[
  {
    "title": "Customer Experience Design Lead",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1241684",
    "job_description": "<strong>An unmissable opportunity to stretch your creative customer-centric design leadership skills with an award-winning team working on highly visible global concepts.</strong> <br /> <br /> <strong>What’s the role?</strong> <br /> <br />At Shell, treating our customers as guests, on and off our garage forecourts is a key ambition. Join us and you’ll relish the opportunity to make an impact on millions of consumers and to play a leading role with an award-winning retail design team. <br /> <br />Your work will span product concepts, service models, customer journeys, industrial designs, system maps and infographics. You’ll design new ways customers can interact with us using technologies such as Chatbot, Voice and AI. <br />You’ll also partner with our Site Format Design Team to ensure a joined up customer experience – where our digital channels meet the in-store experience. <br /> <br />Broadly, there are two different strands to this role: <br /> <ul> <li>You’ll work very closely with our business teams and product owners to manage all delivery aspects of CX and UI/UX with a focus on digital experiences. You’ll be a thought leader on customer experience research and design (backed by quantitative and qualitative research). And you’ll lead our thinking from ideation, refinement and prototyping of Customer Journeys, using an Agile delivery approach.</li> </ul> <ul> <li>You’ll be a leader to our talented team of CX/UI/UX designers, working with them to quickly produce multiple concepts and prototypes. It’s about knowing when to apply pixel-perfect attention to detail, and when a low-fi sketch or prototypes can convey your ideas. Over time, you’ll grow our digital resource, making sure we have the right skills both in house and externally.</li> </ul>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "10-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Connected Customer Delivery Lead",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1241884",
    "job_description": "<strong>This is an unmissable opportunity for a strategic project management leader to join an award-winning team with an exciting digital transformation agenda for retail. Your brief: to shape a new way of working.</strong> <br /> <br /> <strong>What’s the role?</strong> <br /> <br />To fill this technology leadership role we’re looking for a thought leader. Someone who can embed a new way of working that embraces design thinking, customer experience design, product management and agile methodologies. And someone who can inspire Product Owners on the art of the possible when it comes to shaping our go-to-market strategy. <br /> <br />You’ll own product design and development through to releases of minimum viable products and lead a fifty-strong team including Product Managers, Business Analysts and multiple Suppliers who, together, provide full-stack capability. By transforming delivery from Agile to DevOps, you’ll help them to respond more swiftly to new business demands, to improve our speed to market and to better harness the expertise of our Competence Centre. <br /> <br />Clearly, there’s huge scope to innovate and make an individual impression. Ultimately, you’ll be key to realising our business vision for Digital Payments, Loyalty, CRM and Convenience Retail offerings, helping us to increase market penetration, customer sales and brand loyalty both in existing markets and by exploiting growth opportunities. <br /> <br /> <strong>About the team</strong> <br /> <br />Shell Retail Global Marketing IT Competence Centre are the driving force behind an omni-channel experience that includes our flagship Shell App (Mobile) as well as Web, Connected Car, Connected Store and API touchpoints. Here, you’ll be instrumental to the delivery management of a complex, heterogenous and highly integrated technology landscape with a multi-million-dollar annual investment and spanning Single Sign On (SSO), Mobile technology, Web technologies, eCommerce, Web Analytics, API Management, PaaS and SaaS services.",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "10-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "General Manager Digital & Data Analytics",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1255705",
    "job_description": "<font><span><font>Purpose</font></span></font> <br /> <br /> <font><span><font>Lead a team of professionals to drive the Digital Business Transformation across Shell’s Trading &amp; Supply business - supporting innovation of the core business and deliver $1bn in value from (new) digitally enabled business models and services. </font></span></font> <br /> <br /> <font><span><font>Main Accountabilities</font></span></font> <br /> <br /> <font><span><font>Executes the duties of a T&amp;S Chief Data Officer: </font></span></font> <br /> <br /> <ul> <li><font><font>Design, develop, continuously enhance, ensure integrity and operationalise Trading and Supply data governance, collection, models, landscapes and uses to drive value. </font></font></li> <li><font><font>Design, develop, continuously enhance and operationalize business management information strategies, visualization, platforms and access to achieve solutions that are cognitive enhancing, predictive, drive insight, enhance value and evolve to self-serve. </font></font></li> <li><font><font>Embed in the business management information tools, skills, know-how to increase the organisation’s data access, exploitation and data analytics acumen.</font></font></li> </ul> <br /> <font><span><font>Drive digital innovation and transformation</font></span></font> <br /> <br /> <ul> <li><font><font>Deliver strategy and programmes that lead the rotation into “NEW” and disrupting technologies (i.e., intelligent automation, cloud, blockchain, artificial intelligence, machine learning, analytics)</font></font></li> <li><font><font>Support Business Excellence Process Owners in bringing innovation to Trading &amp; Supply processes to drive year-on-year yield improvement. </font></font></li> <li><font><font>Support the development of agile IT roadmaps/eco-systems and (potentially) managing a portfolio of digital investments (prioritisation of CAPEX/OPEX).</font></font></li> <li><font><font>Consult and assist business leaders with business transformations through information &amp; insight, innovation and technology advancements</font></font></li> <li><font><font>Drive a “Customer Centricity” innovation agenda by re-imagining how transactions occur in a way that brings value to the customer.</font></font></li> </ul> <br /> <font><span><font>Third Party &amp; Enterprise Collaboration</font></span></font> <br /> <br /> <ul> <li><font><font>Deliver the Digitalisation agenda, vetting and decision making on selection of third party vendors, active scanning of internal and external opportunities and delivering priorities established by the Shell Group, Downstream and Trading and Supply leadership.</font></font></li> <li><font><font>Partner with specialist companies and other Shell organisations, to leverage and drive integration opportunities.</font></font></li> <li><font><font>Contribute and link into wider Royal Dutch Shell Digital agenda (Upstream, Integrated Gas, Downstream, New Energies)</font></font></li> <li><font><font>Drive a more agile and customer-centric innovation approach through use of standard methodologies, approaches to piloting and learning</font></font></li> </ul> <br /> <font><span><font>Business Excellence Leadership</font></span></font> <br /> <br /> <ul> <li><font><font>A T&amp;S Business Excellence Leadership position required to maintain a strong working relationship with the other Excellence Leaders to foster innovation, talent development and succession planning. </font></font></li> <li><font><font>Continuously improve business knowledge, technical capabilities, and problem-solving skills, and help Business Leaders and team members to do the same</font></font></li> </ul> <font><font><span>Keep Trading and Supply Leadership and Extended Leadership informed on innovation developments that may benefit or threaten our commercial activity.</span></font></font> <br />",
    "skill_group": "Trading",
    "location": "United Kingdom",
    "last_updated": "10-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Head of Product Development – Consumer Energy",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1256157",
    "job_description": "<strong>In an exciting, ever-changing energy landscape, you’ll help Shell to explore brand new territory, shaping our offer to a new market: residential customers. It’s a highly visible, once-in-a-career opportunity to build our presence from the ground up in a completely new field. </strong> <br /> <br /> <strong>Where you fit in</strong> <br /> <br />Shell’s New Energies organisation exists to invest and innovate in renewable power generation, connected energy and improving access to energy. A key part of that is our highly influential Energy Solutions team whose brief is to exploit new technology, and develop compelling propositions that help Residential, Commercial and Industrial sector customers to meet their energy needs, today and tomorrow. <br /> <br /> <strong>What’s the role?</strong> <br /> <br />In March 2018, Shell acquired First Utility, a leading UK household energy and broadband provider. We think that the rapidly evolving retail energy market is a natural place for us to expand, capitalising on the trusted relationships we’ve built with millions of forecourt customers. We aim to grow our customer base by offering an attractive range of products and a real alternative to other companies in the sector – and that’s where you come in. <br /> <br />Reporting directly to our BOM Consumer Energy, this role sits strategically at the intersection of product management, marketing, policy and business development. You’ll shape and own the solutions strategy for our Residential segment to competitively position Consumer Energy for success. You’ll turn strategy into a multi-year plan, capturing value from First Utility as well as other parts of Shell, notably New Motion, one of Europe’s largest electric vehicle charging providers. <br /> <br />The sky is the limit. Succeed in capturing the market share we’re targeting in the UK and you could further develop into new European territories or B2B markets. Your success will depend on a number of factors, including: <ul> <li>Capturing incremental value through continued product development and sequential product launches.</li> <li>Building a portfolio in close partnership with different Shell Ventures companies, skilfully capturing their needs and the needs of their end customers.</li> <li>Translating ideas, opportunities and problems into use cases to iteratively develop solutions that meet customer expectations and can be brought to market in a repeatable, scalable manner. </li> <li>Cultivating new partnerships with solutions and technology providers to deliver the integrated portfolio of Consumer Energy solutions.</li> <li>Building Connected Energy’s solutions development capabilities through the use of Agile development principles and related methodologies like Scrum.</li> </ul>",
    "skill_group": "Commercial and Retail",
    "location": "Netherlands, United Kingdom",
    "last_updated": "10-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Agile Coach",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1207938",
    "job_description": "<strong>We need an Agile champion – someone with the knowledge and influence to help us embed Agile in our IT function and beyond. There’s huge scope here to change our mindset and maximise the value we derive; it could be a CV-changing role for you.</strong> <br /> <br /> <strong>What’s the role?</strong> <br /> <br />It’s a great time to bring your Agile and Lean skills to Shell, specifically to our IT enterprise. You’ll be instrumental in helping us to establish and evolve an Agile mindset – not just within IT project teams, but also in the wider stakeholder community. You’ll need to leverage existing processes and practices and steer the IT enterprise towards full best practice for Agile project delivery, DevOps and related capabilities. <br /> <br />We’re looking for someone who’s highly collaborative, excited by change and ready to rise to challenges including: <br /> <ul> <li>Teaching, mentoring and coaching individuals, teams, and leadership to understand and apply Agile and Lean values, principles, and practices.</li> <li>Working across organisational boundaries and with external partners and suppliers to cultivate an Agile community; driving effective practice embedding.</li> <li>Involving people in change and influencing through others to ensure that IT (and the wider business) understands Agility – and how we can derive maximum value from it.</li> <li>Maximising efficiency, driving out waste and pinpointing activities that add value.</li> </ul>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "09-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "IT Project Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1215220",
    "job_description": "<strong>If you’re a proven project manager with application development or ERP experience, who enjoys bringing out the best in a team, this role is a chance to help deliver high-profile projects that help Shell meet the UK’s growing energy demand, harnessing innovative techniques and advanced tech to develop cleaner energy. </strong> <br /> <br /> <strong>What’s the role?</strong> <br /> <br />Life doesn’t stand still here – it’s a fast-paced, challenging and incredibly rewarding place to work. You’ll take care of IT projects throughout the lifecycle – from planning and execution to control and closure. As a senior member of our team, you’ll set the strategy, deciding the governance structures that drive decisions and resolve issues, and defining the success metrics, working closely with business stakeholders. <br /> <br />It’s part of your remit to create and validate financial forecasts and provide ongoing reconciliation of resources and expenditures. You’ll also proactively analyse risks and rigorously manage scope: if a project is at risk, you know when to escalate, to ensure that we deliver the business benefits on time, on budget and to the agreed quality parameters. <br /> <br />It’s a great role for someone who enjoys building relationships. Typically managing around 10-20 FTEs per project, you’ll ensure excellent communications with stakeholders, making sure they feel informed and involved every step of way. You’ll also enjoy bringing out the best in your team, whether that’s through sharing information and managing workloads or through coaching, encouragement and recognition of a job well done. <br /> <br />",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "09-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "EMEA Product Stewardship Regulatory Compliance Coordinator",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1242603",
    "job_description": "<p>This role coordinates the product regulatory compliance work in Europe, Africa and Middle East region, and provides the necessary technical support to ensure ongoing compliance of EU REACH and CLP, national EU Member State Legislation, KKDIK (Turkey REACH) in Turkey, new regulations in the Eurasian Economic area, the African region and the Middle East.</p> <p>This position will work with and lead a diverse network of local product regulatory support roles in the individual countries to ensure compliance with existing product regulations, monitoring of emerging national legislation, and coordinating timely and efficient implementation of relevant regulations.</p> <p>This role leads the compliance project on harmonized poison centre notifications to completion in cooperation with the business, IT and regional regulatory networks.</p> <p>Proximity to regional businesses and regular engagement with stakeholders is important to understand their individual business plans and strategies, supply chains, pressures form customers and/or consumers and regulators and anticipate necessary actions to ensure ongoing compliance.</p>",
    "skill_group": "Health Safety Environment & Security",
    "location": "Netherlands, United Kingdom",
    "last_updated": "09-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Real Estate Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1251674",
    "job_description": "<font><font><strong>If you want to be part of a Real Estate team that measures success through the business partnerships we build and the value we create rather than through steel, glass, bricks and mortar, this could be a highly fulfilling move for you.</strong><br /> <br /><strong>Where you fit in</strong><br /> <br />You’ll be part of a sizeable, successful Real Estate team that manages Shell’s property portfolio, shared service centers, corporate travel programme and office facilities. With a global outlook, our role is to make Shell a great place to work, live, visit and play – both today and by shaping our future plans.<br /> <br />Join us and you’ll find that we take a proactive, data-driven approach to ensure we’re a valued partner to the business. We measure our success not through the fabric of our real estate itself but in terms of the relationships we build and the business value we generate.<br /> <br /><strong>About the role</strong><br /> <br />Your role is to manage an assigned portfolio of including construction and refurbishment projects as well as commercial deals (acquisitions, disposition, lease negotiations). There’s a focus on Asset Management – you’ll proactively review and monitor your allocated portfolios throughout the year, to keep abreast of upcoming activities and identify portfolio opportunities. Throughout, you’ll ensure that local delivery fits in with our wider commercial strategy, portfolio plans and Group requirements.<br /> <br />Supported by some of the very best RE professionals, you can look forward to stretching your skills, delivering significant property projects and commercial deals, and conducting complex negotiations, either on your own or as part of a professional team. You’ll be an ambassador for RE: a valued partner to the business who’s trusted to deliver with efficiency, discipline and professionalism. You’ll also relish cultivating your network by forging relationships with other portfolio managers, both in your region and across the world.</font></font> <div> <div> <div></div> </div> </div>",
    "skill_group": "Real Estate",
    "location": "Netherlands, United Kingdom",
    "last_updated": "09-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Senior Marketing Advisor - UK",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1243103",
    "job_description": "<strong>An exciting opportunity for an experienced marketeer to gain experience with employer branding and job marketing in the highly competitive UK employer market – a great chance to build your marketing CV.</strong> <br /> <br /> <strong>What’s the role?</strong> <br /> <br />Hiring the best talent is key to Shell’s success today and in the future. As Country Marketing Advisor for the UK, you’ll create overall brand impact to inspire and attract the very best UK talent to apply for Shell, harnessing the latest marketing techniques and technologies in digital marketing, social media, events and job marketing. <br /> <br />The UK is a vital talent market for Shell and a very competitive one. You’ll be equipping us to compete for the best talent with the biggest brands in the market, including well-known tech companies and FMCG brands. Your input stretches from graduates to experienced hires; from developing insights and identifying channels to market, to improving our candidate experience and attracting the right applications. <br /> <br />It’s a role that combines the best aspects of HR and marketing – you’ll work closely with our UK recruitment manager and other stakeholders to shape the marketing plan and understand Diversity and Inclusion aims; you’ll also liaise with our digital marketing teams to develop campaigns that attract, engage and convert candidates. Cultivating links on campus and university careers services to position Shell as a preferred employer is another collaborative aspect to the role. <br />",
    "skill_group": "Commercial and Retail",
    "location": "United Kingdom",
    "last_updated": "06-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Transformational Change Manager - IT",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1253588",
    "job_description": "<p><font><font>The role is to drive business transformation and sustain the change required by Shell’s IT simplification agenda. Shell is focused on aligning and simplifying IT systems to increase customer satisfaction and business value which will drive significant and ongoing change in all parts of the business, underpinning the business’ growth agenda. Shell is building an inhouse IT Business Transformation Capability that will partner closely with each area of the business to drive and embed IT change. This role will be a senior expert position, reporting to the GM Transformational Change within the Group CIO function. The role is delivery focused and will lead IT-driven business change in a programme or project environment.</font></font></p> <br /> <p><font><font>The primary purpose of the role is to:</font></font></p> <br /> <p><font>Engage with senior business and IT leaders and executives to drive the change agenda</font></p> <br /> <p><font>Lead and run one or multiple change programmes, partnering with IT Programme and Project managers, devising the plan and implanting the Shell method</font></p> <br /> <p><font>Drive business value and business outcomes through the management of measurable change management and business transformation interventions, usually in an Agile context</font></p> <br /> <p><font>Advise, coach, manage and mentor more junior change managers often via matrix leadership to build the capability</font></p> <br /> <p><font>Take responsibility for a large business area, liaising with executive stakeholders and managing the portfolio of demand for business transformation resource</font></p> <br /> <p><font>Work closely and collaborate with peers leading change across other areas of Shell’s business</font></p> <br /> <p><font>Work closely and collaboratively with other related departments, OD/OE, Internal Communications, Learning and Continuous Improvement, within Shell to deliver a comprehensive service to the business</font></p> <br /> <p><font>Equip the business with the skills to better manage and sustain change</font><br /><br /> </p> <br /> <p><span>Accountabilities</span></p> <br /> <br /> <dir> <br /> </dir> <br /> <br /> <p><font>Partner with CIOs and IT / Delivery Managers (as a subject matter expert and trusted advisor) in:</font></p> <br /> <p><font>Assessing and classifying the business change to determine the right change strategy and approach </font></p> <br /> <p><font>Providing expert change strategy and planning to IT-enabled business change challenges</font></p> <br /> <p><font>Ensuring that the appropriate change management tools and methods are applied to IT projects</font></p> <br /> <p><font>Partnering with other parts of the organisation (IC, OD, Learning) to deliver high quality change management interventions</font></p> <br /> <p><font>Providing expert coaching and advice on CM activities to help changing mindsets and behaviours to IT professionals involved in project delivery</font></p> <br /> <p><font>Developing agile mindsets and behaviours</font></p> <br /> <p><font>As a senior member of the IT Business Transformation Capability, create an environment where members feel motivated, engaged, connected, able to perform to high levels and to grow and develop in their roles. This may include Line Manager responsibility.</font></p> <br /> <p><font>Act as a conduit for sourcing specialist external consulting support where needed</font></p> <br /> <p><font>Work to develop the Capability and facilitate knowledge sharing and capturing of good practice, and (in conjunction with OD peers) be sufficiently connected with external bodies to continue to leverage the experience and insight of others</font></p> <br /> <p><br /><br /> </p>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "06-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Offshore Structures Engineer",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1249916",
    "job_description": "<font><font>The Offshore Structures Engineer provides technical support and assurance to projects and asset teams spanning across the entire life-cycle of fixed and floating structures. The primary objective of the role is to ensure the technical integrity of the design and construction of UK production facilities. The successful candidate is expected to create and deliver fit-for-purpose technical solutions and take ownership of matters relating to systems engineering design, structural concept selection, specification, construction, commissioning, operation and decommissioning activities. </font></font>",
    "skill_group": "Discipline Engineering",
    "location": "United Kingdom",
    "last_updated": "05-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Management Assistant",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1249137",
    "job_description": "<strong>What is the role?</strong> <br /> <br />To execute effective and efficient secretarial duties and administrative support to the head of communications in the UK, including strong support to finance and budget management and with the opportunity to become selectively involved in specific communications projects and events as part of a dynamic and friendly team. <br /> <br /> <strong>The role responsibilities include:</strong> <br /> <br />• Providing full, pro-active and highly confidential admin and secretarial support including: diary management (co-ordinating and arranging internal and external meetings); reading, screening (and sometimes actioning) e-mail, incoming correspondence, phone calls and general inquiries; planning and organising a variety of styles of meetings (taking care of the agenda, HSSE, logistics, catering and ensuring attendance); plan, organise and book travel arrangements, teleconferences, meetings and workshops; assisting in preparation of presentations, reports and other documents by liaising with others to collect and prepare information. <br />• Budget management co-ordination including raising purchase orders, tracking supplier invoices, maintaining the team budget spreadsheet through close liaison with team, monitoring and claiming expenses <br />• Co-ordination and promotion to staff of a number of corporate benefits <br />• Build and maintain a network of contacts in the organisation to ensure an effective and efficient working environment. <br />• Handle arrangements for visitors including meetings on and off site and social functions if required. <br />• Arrange on-boarding requirements of new staff <br />• Support team Sharepoint Site, maintain team organogram and key reference documents <br />• Act as team Business Continuity Focalpoint and Information Management and Compliance Focalpoint <br />• Ensure efficiency and continuity of the department in times of absence of line management. <br />• Flexibility to step in to provide support to the UK Country Chair and other ER leaders in Shell Centre. <br /> <br /> <strong>Dimensions</strong> <br /> <br />• Managing a varied workload often under pressure <br />• When required an appropriate level of flexibility in working hours is needed <br />",
    "skill_group": "Business Administration",
    "location": "United Kingdom",
    "last_updated": "04-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Reward Manager, Trading",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1216625",
    "job_description": "<strong><u><font><font>About Us</font></font></u></strong> <br /> <br /> <font><font>The global Reward centre of expertise in Human Resources comprises a small number of functional specialists who are accountable for developing and operationalising employee reward arrangements across the world that align with Shell’s strategy and support its business objectives.<br /><br />Shell Trading and Shipping integrates a worldwide trading network with an unsurpassed global portfolio in crude oil, refined products, natural gas, electrical power, and chemicals and has larger locations in London, Houston, Calgary, Singapore, Dubai and Rotterdam. Building on over 100 years of heritage in oil and gas production, shipping and marketing, Shell is the world’s largest global energy trader, with a reputation for bringing innovative new products to the market. </font></font> <br /> <br /> <strong><font><font>About our team &amp; what we do:</font></font></strong> <br /> <br /> <font><font>The global Reward team works closely with country and business HR to develop and operationalise reward arrangements across Shell. This includes providing strategic direction on reward, market benchmarking of pay and benefits and leading the annual pay review and periodic reviews of reward policies. </font></font> <br /> <br /> <strong><font><font>Your role &amp; responsibilities:</font></font></strong> <br /> <font><font>Your primary responsibility will be to (re)develop and operationalise specific reward arrangements that support Trading and Shipping’s business objectives, where these need to be different from the generally applicable reward arrangements. </font></font> <br /> <br /> <strong><font><font>Typical activities:</font></font></strong> <br /> <ul> <li><font><font>Reviewing the specific reward policies for Trading and Shipping and ensuring that these are kept in line with business strategy and objectives.</font></font></li> <li><font><font>Meeting regularly with senior line leaders to ensure a good understanding of reward issues, and providing advice on policy application as required.</font></font></li> <li><font><font>Keeping in close touch with external market developments in reward.</font></font></li> <li><font><font>Working with colleagues to access and analyse relevant market benchmark data.</font></font></li> <li><font><font>Developing base pay and bonus proposals that respond to external market developments and appropriately reward individual and business performance.</font></font></li> <li><font><font>Presenting such proposals to senior stakeholders and obtaining their approval.</font></font></li> </ul>",
    "skill_group": "Human Resources",
    "location": "United Kingdom",
    "last_updated": "03-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Program Lead - Aviation",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1224033",
    "job_description": "<table> <tbody> <tr> <td> <div> <span> <o:p></o:p></span> <strong><font><font>Shell Aviation is looking for someone with the commercial acumen and project management skills to help fuel the growth of Shell’s Aviation business by sharpening our operational excellence, implementing our new value propositions and streamlining the way we work. There’s huge scope to make an impact here. </font></font></strong> <br /> <br /> <strong><font><font>Where you fit in</font></font></strong> <br /> <br /> <font><font>Shell is one of the largest and most successful companies when it comes to supplying the aviation sector. You’ll find us at about 850 airports in 32 countries. Every day, on average, we supply 72 million litres of fuel and refuel an aircraft every 14 seconds. You’ll be a key part of a team covering Europe and Africa where we operate in more than 280 locations. </font></font> <br /> <br /> <strong><font><font>What’s the role?</font></font></strong> <br /> <br /> <font><font>Working closely with our regional and global Business Development and operational excellence teams, this challenging role supports our ambitious growth plans for Aviation. You’ll lead and co-ordinate our Operations program for projects in Europe and South Africa with a brief to execute operational excellence and new value proposition ideas through continuous improvement while also reducing costs – there’s scope to simplify and optimise parts of our operation, both the overall operations model and the way we handle New Airport Entries (NAEs) and New Market Entries (NMEs).</font></font> <br /> <br /> <font><font>You’ll look to drive and deliver improvements in yield KPIs in the region –</font></font> <br /> <font><font>particularly margin/cost, optimisation of assets and equity investments. If you can do that and deliver quantifiable, tangible value for the customer, you’ll be making a very visible impact on our business. </font></font> <br /> <br /> <span> <o:p></o:p></span> </div></td> </tr> </tbody> </table>",
    "skill_group": "Commercial and Retail",
    "location": "Netherlands, United Kingdom",
    "last_updated": "03-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "eBanking Support Analyst",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1234939",
    "job_description": "<font><font><strong>What is the role?</strong><br /><br />The eBanking Operations Support Team is responsible for the daily end to end support of eBanking interfaces for the Shell Finance business units by ensuring that application services meet or exceed agreed SLAs by provision of application support and fault resolution services for eBanking. The eBanking Support Analyst is responsible for the resolution of eBanking issues that arise during the payment and bank statement process. This will involve actively monitoring and working on the incoming requests sent to the eBanking 2nd line support mailbox by the business units. The eBanking Support Analyst actively and professionally communicates with the business users, business teams, the eBanking first line team and external teams when resolving issues in a timely manner.</font></font> <br /> <br /> <br /> <strong><font><font>The main responsibilities are:</font></font></strong> <br /> <ul> <li><font><font>Resolve all severity levels of incidents in a timely fashion in order to ensure business continuity and meet SLA requirements.</font></font></li> <li><font><font>Analyze business requirements and translate these into technical specifications for data mapping in line with the strategic eBanking message standards.</font></font></li> <li><font><font>Proactively monitor service outcomes for positive/negative patterns in readiness to initiate service improvements and recommendations for remedial actions.</font></font></li> <li><font><font>Provide deliverables within the areas of 'Incident' and 'Change and Problem', technical project work, mapping activities and software configuration within the system environments.</font></font></li> <li><font><font>Participate in the preparation and execution of DRP tests.</font></font></li> <li><font><font>Ensures incident ticket handling is timely performed.</font></font></li> <li><font><font>Proactively knows how to prevent business interruptions. Timely involves internal and or external parties in case issues result into business interruptions </font></font></li> <li><font><font>Proactively sends out communication emails to stakeholders in case of business interruptions.</font></font></li> <li><font><span><font>Ensure operation runbooks, support guidelines, and procedures are produced and maintained for use.</font></span></font></li> </ul>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "03-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Senior Cryogenic Marine Engineer",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1251554",
    "job_description": "<font><font><span>Shell Shipping and Maritime have a vacancy for a Senior Cryogenic Marine Engineer within the Technology &amp; Innovation department. This is a permanent position within the organization, with </span><span>the successful candidate providing Marine and Cryogenic Engineering support to a wide variety of Maritime projects across Shell Group business units, Upstream, Integrated Gas and Downstream. The anticipated range of projects will include Re-Gas (FSRU projects), Liquid Hydrogen Shipping, Downstream LNG including LNG as a Marine Fuel, Trading and Supply with support for the ship building program, FPSO projects as well as new Technology Development in support of the Shipping and Maritime Technology &amp; Innovation R&amp;D program.</span></font></font> <br /> <span><font><font>The role is London based, however it will involve some international travel.</font></font></span> <br /> <strong><font><font>Position Description &amp; Responsibilities:</font></font></strong> <br /> <font><font>The successful candidate will be accountable for the following:-</font></font> <br /> <ul> <li><font><font>Participate and lead Marine Engineering discipline support to project teams for new construction and conversions, including the preparation of outline specifications, evaluation of tenders, negotiation with short listed bidders, plan approval, design discussions with builder, attendance at factory acceptance tests, commissioning and trials.</font></font></li> <li><font><font>Act as the company representative/liaison with professional industrial bodies, classification societies, shipyards, shipping fleet management operation units and Shell Group discipline engineers. </font></font></li> <li><font><font>Identify means for cost savings whilst maintaining the highest levels of safety and creating the appropriate climate for innovation within the Marine Engineering discipline.</font></font></li> <li><font><font>Present complex marine and cryogenic technical issues in a manner to persuade and influence non-technical people, either from within the Shell Group or joint venture partners, in the direction which best serves the business needs.</font></font></li> </ul>",
    "skill_group": "Maritime",
    "location": "United Kingdom",
    "last_updated": "03-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Business Analyst - SAP MM",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1223726",
    "job_description": "<strong><font><font>If you have proven technical and functional SAP MM skills this is a great chance to join a growing team with people widely respected for their expertise and well connected with the business.</font></font></strong> <br /> <br /> <strong><font><font>What’s the role?</font></font></strong> <br /> <br /> <font><font>We need a Business Analyst to join our growing, international team. SAP and, increasingly, S4Hana are vital to the way we work so you can be certain your skills will be valued and developed here. If you want to be part of an environment where good process knowledge meets digitalization, working with the latest integration technologies, you’ll be in your element.</font></font> <br /> <br /> <font><font>It’s an end-to-end role, stretching from clarifying analytical requirements (from a technical design perspective), estimating and developing functional specification through to developing solutions related to Production Execution and Quality Management processes in SAP. You’ll also see project through prototyping and unit testing. A key challenge will be to quickly grasp existing designs and to roll out new templates on demand, working with batch job scheduling and processing tools.</font></font> <br />",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "02-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Project Manager Payments - Retail IT",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1238422",
    "job_description": "<strong><font><font>We need a highly collaborative project manager with experience of card payment systems to join us in this accountable role. You’ll be working at the heart of some innovative global retail projects spanning an engaging range of new technologies.</font></font></strong> <br /> <br /> <strong><font><font>What’s the role?</font></font></strong> <br /> <font><font>Here at Shell, we trust our Project Managers to take care of projects from start to finish: from planning and executing through to monitoring, controlling and closing. </font></font> <br /> <font><font>This is a chance to join a well-respected team, working on Retail IT projects: strategic initiatives that span an eye-opening range of many technologies including mobile applications, electronic payment, analytics and Customer Relationship Management. </font></font> <br /> <br /> <font><font>Your remit includes:</font></font> <br /> <ul> <li><font><font>Rigorously managing scope to ensure we deliver business benefits to agreed time, cost and quality parameters</font></font></li> <li><font><font>Identifying required risk and control frameworks </font></font></li> <li><font><font>Validating financial forecasts; reconciling resources</font></font></li> <li><font><font>Defining and tracking project milestones; reporting on overall delivery</font></font></li> </ul> <br /> <font><font><strong>About Shell Retail Fleet Solutions</strong><br />There’s huge scope to develop here. The world’s largest fuel retailer, Shell serves 30 million customers across 80 countries every day. Our loyalty cards are used 260 million times annually – and each year we sell 200 billion litres of fuel and 250 million cups of coffee. </font></font> <br /> <br /> <font><font>Shell fleet solutions is a dynamic growth area within Shell’s retail business operating in more than 30 countries across the world with the ambition to be the business customer’s first choice for sustainable mobility solutions. It is the biggest B2B card company in the world, with 235 M fuel and non-fuel transactions per year and around 6 million Shell cards and Euro Shell cards in circulation. Digital offers and mobility services is at the heart of its ambitious growth strategy – laying the ground for a number of exciting investments and projects related to new digital technologies, and innovative steps in card offerings, payments and online services. </font></font> <br /> <br /> <font><font>Join us and you could be running projects worth anywhere between $0.5m and $10m to improve petrol station point of sale, payment terminal and back office systems, new cutting edge card issuing, payment and processing technologies, deliver new digital capabilities and mobile capabilities or to simply ensure existing systems keep pace with compliance requirements. </font></font> <br /> <br />",
    "skill_group": "Information Technology",
    "location": "Netherlands, United Kingdom",
    "last_updated": "02-Jul-2018",
    "hot_job": "No"
  },
  {
    "title": "Company Secretarial Advisor",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1243632",
    "job_description": "<font><font>This role offers a unique opportunity to join one of the world’s most successful companies. With around 92,000 employees in more than 70 countries, Shell operates on a scale few can rival. The complexity of the organization, the senior level stakeholder exposure, the fast changing and evolving circumstances in the Oil &amp; Gas sector offer a unique opportunity for a work environment that will continue to challenge.<br /><br /><u><strong>Purpose of the Role</strong></u><br />Support the shaping and development of Shell subsidiary management best practice whilst ensuring compliance with changing statutory, regulatory and corporate governance landscape.</font></font> <br /> <br /> <font><font>Manage the provision of subsidiary management services for a portfolio of Shell corporate entities.</font></font> <br /> <br /> <font><font>Promote the Company Secretariat team profile to ensure greater structure to ways of working, efficient planning and task management.</font></font> <br /> <br /> <br /> <span><font><font><u><strong>Key Accountabilities</strong></u></font></font></span> <br /> <font><font>Providing advice and guidance on governance best practice and legal entity administration</font></font> <ul> <li><font><font>Review all subsidiary governance processes, controls and ways of working within the Secretariat team</font></font></li> <li><font><font>Review Shell’s subsidiary management policies and frameworks</font></font></li> <li><font><font>Identifying and adopt new ways of working and implement new processes</font></font></li> <li><font><font>Delivery of ad hoc corporate governance projects</font></font></li> <li><font><font>Developing and sustaining relationships with clients and colleagues at all levels</font></font></li> <li><font><font>Providing company secretarial services and advice to and in connection with a portfolio of UK subsidiary companies; including statutory compliance activities for such companies, shareholder and board actions, advice on governance and company secretarial issues, participation in liquidating, restructuring and other corporate projects and transactions, responsibilities for company secretarial processes, procedures, databases and know-how</font></font></li> </ul> <br />",
    "skill_group": "Legal",
    "location": "United Kingdom",
    "last_updated": "28-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "GB Power Supply Analyst",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1244093",
    "job_description": "<span><font><font>After beginning execution of our Power Growth Strategy in 2016, SEE has launched a business in Great Britain buying power from small generators (renewable and combined-heat-and-power) and selling power to industrial and commercial consumers. We have successfully grown the number of meter points served and plan to grow further in 2018 and beyond. We therefore now plan to grow the London-based team managing these meter points and supporting the production of accurate invoices.</font></font></span> <br /> <br /> <span><font><font>This is an exciting opportunity to get early involvement in the operational management of an important growth area for T the Shell Group, developing skills and experiences which will be crucial to Shell achieving its goal of profitably meeting society’s needs and proving a world-class investment case, as we navigate through the energy transition towards a low-carbon energy system. </font></font></span> <br /> <br /> <span><font><font>Day-to-day activities include: setting up and maintaining contracts with power customers, including:, supporting billing and invoice reconciliation, managing vendors and industry participants supporting Shell’s business in this area:</font></font></span> <br /> <br /> <br /> <br /> <ul> <li><span><font><font>Initiating and maintaining distribution grid connections - registration of new meters to Shell’s power balancing accounts</font></font></span></li> <li><span><font><font>Working with metering agents, monitoring the timeliness and quality of data (e.g. volume reads) coming from the systems, and taking steps to rectify where necessary</font></font></span></li> <li><span><font><font>Supporting customer bill preparation</font></font></span></li> <li><span><font><font>Reconciliation and payment of relevant industry fees and levies, including troubleshooting late/missing/erroneous data from industry participants</font></font></span></li> <li><span><font><font>Working with IT vendors and supporting the overall evolution of IT systems to support SEE supplying power to end-users/small generators</font></font></span></li> <li><span><font><font>Enhancing/streamlining processes</font></font></span></li> <li><span><font><font>Supporting customer relationships</font></font></span></li> <li><span><font><font>Manage/oversee compliance/reporting communications and activities with industry bodies/participants within GB, executing many of the activities and communications.</font></font></span></li> </ul>",
    "skill_group": "Trading",
    "location": "United Kingdom",
    "last_updated": "28-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Managing Director for Implementation, Global Origination & Investments",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1233115",
    "job_description": "<p><font><font>The Global Origination &amp; Investments Team (O&amp;I) of Shell Trading and Supply is responsible for at scale, medium-long term opportunity identification, origination, deal delivery and investments in Oil Products and Crude. It operates across commodities and regions, to convene and lead integrated deal teams representing the suite of Shell’s downstream and trading lines of business with significant accountability for new margin contribution. </font></font><br /><font><font> In addition to deals with traditional business models across commodities and regions, O&amp;I looks after investments focused on bridging for energy transitions, digital transformation and innovation.</font></font><br /><font><font> The MD for Implementation is accountable for managing a team of deal structurers and analysts to structure, deliver and enable successful implementation of the O&amp;I team’s funnel of transformative opportunities and mega deals. The incumbent will provide leadership to a team located across Shell’s major Trading Hubs globally and enable them to deliver in a complex, high-pressured deal environment. He or she will report to the Head of O&amp;I based in London.</font></font><br /><br /> </p>",
    "skill_group": "Commercial and Retail",
    "location": "United Kingdom",
    "last_updated": "27-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Learning Advisor",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1246166",
    "job_description": "A great opportunity to support 20,000+ people globally in our fast-changing functional teams, including Finance, HR and IT – it’s a fantastic shop window for your organisational development expertise. <br /> <br /> <u>What’s the role?</u> <br />Part of a global team, you’ll provide expert consulting and advice to our top leaders, and enable capability building at individual, leader/team, and organisational levels. It’s a role that will put you at the cutting edge of corporate life – our functions are continuously changing and innovating to adapt to digitalisation, new ways of working, changing business requirements and stakeholder expectations. <br /> <br />You’ll relish working collaboratively across the functions. We’ll also trust you to focus on a specific functional team, cultivating a deep understanding of their capability needs both now and in future. From there, you’ll help develop creative solutions, leveraging the full spectrum of methods: from on-the-job and blended coaching and mentoring to classroom activities, collaboration networks and knowledge management tools. <br />",
    "skill_group": "Human Resources",
    "location": "Netherlands, United Kingdom",
    "last_updated": "27-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Global (Reputation and Brand) Insights Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1239683",
    "job_description": "<p><font><font><span>The External Relations (ER) function in Shell is tasked with enabling the delivery of Shell’s purpose and strategy. We achieve this by building trust and leveraging our brand and reputation; and by making a positive impact on the communities and wider societies in which we work. <span>　</span></span></font></font></p> <p><font><font><span>The function is comprised of dedicated communications teams within four areas of the business, as well as our five centres of excellence:</span></font></font></p> <p><font><font><span><span>Brand</span></span></font></font></p> <p><font><font><span>Media Relations &amp; Editorial</span></font></font></p> <p><font><font><span>Stakeholder Relations</span></font></font></p> <p><font><font><span>Social Performance</span></font></font></p> <p><font><font><span>Strategy and Planning</span></font></font></p> <p><font><font><span>This role is to lead the Global reputation and brand Insights team within the wider ER Strategy and Planning team. The team <span>helps Shell understand its external audiences through a combination of opinion research (qualitative and quantitative, tracking and ad hoc projects) and media monitoring and analysis (traditional, broadcast, social and digital) in order to help inform the company’s strategy, business and communications activities in an open, honest and transparent way. </span></span></font></font></p> <p><font><font><span><b><u>Your role/scope</u></b></span></font></font></p> <p><font><font><span>As someone with outstanding opinion research and communication and media measurement skills you will support the business in generating and delivering valuable analysis and insights. </span></font></font></p> <p><font><font><span>In order to support the business you will:<br /><br /><font><font>Manage and support the development (professional and personal) of a team of 4 opinion research and media analysis professionals</font></font></span></font></font></p> <p><font><font><font><font>Manage the contractual relationship between Shell and its opinion research suppliers and oversee its relationship with its media analysis suppliers</font></font></font></font></p> <p><font><font><font><font>Lead the Shell global reputation tracking programme, global news media monitoring programme and ad hoc business insights projects from design to activation workshop </font></font></font></font></p> <p><font><font><font><font>Review on a regular basis the resource requirements needed to deliver the insights programme and look for opportunities for efficiencies and enhancements</font></font></font></font></p> <p><font><font><font><font>Take a leading role in helping the ER Function actively use the insights generated</font></font></font></font></p>",
    "skill_group": "Corporate & External Affairs",
    "location": "Netherlands, United Kingdom",
    "last_updated": "22-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Digital Enterprise Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1245759",
    "job_description": "<div> <div> <font><font><strong><font>About Global Commercial - Lubricants</font></strong><br /><br /><font>Shell sells a wide variety of lubricants to meet customer needs across a range of applications. These include consumer motoring, heavy-duty transport, mining, power generation and general engineering. Shell’s portfolio of lubricant brands includes Shell Helix, Shell Rimula and Shell Tellus. We distribute, market and sell lubricants in over 100 countries. We also provide technical and business support to customers. We offer lubricant-related services in addition to our product range. These include Shell LubeMatch, the market leading product on-line recommendation tool, and Shell LubeAnalyst. </font><br /><font>This position supports the European Cluster organisation and reports to EU digital and Ecommerce manager. The Digital Enterprise Manager - Europe position is responsible for maximizing value of startups that Shell has invested in and generating synergies between downstream business and aggregators as well as managing large ecommerce accounts and ecommerce agencies. </font><br /><br /><font>The person will be accountable for piloting, testing and optimizing these business models to achieve and maintain significant financial returns.</font><br /><br /><br /><strong><font>What will you do:</font></strong><br /> </font></font> <ul> <li><font><font><font>Leverage Shell ecosystem to maximize value of start-ups Shell has invested in</font></font></font></li> <li><font><font><font>Manage large e-commerce accounts (Ebay, Amazon) and e-commerce agencies </font></font></font></li> <li><font><font><font>Develop new business models to generate online sales</font></font></font></li> <li><font><font><font>Provide evidence-based analysis of the commercial value generated by digital programmes ensuring rigorous piloting of programs takes place and processes to learn, optimize and iterate</font></font></font></li> <li><font><font><font>Share best-practices across the region on implementation and continually learn from implementation to inform future development of ecommerce </font></font></font></li> </ul> </div> </div>",
    "skill_group": "Commercial and Retail",
    "location": "United Kingdom",
    "last_updated": "21-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "IT Project Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1247384",
    "job_description": "• Ensure Shell’s Project Delivery Framework &amp; Downstream IT processes and practices are adhered to, both in Agile and Waterfall project delivery methodologies <br />• Own up right from the Project Initiation till the project closure with clear key deliverables by project phases, and key benefits to the organization <br />• Directly manage and work with senior Business and IT stakeholders/partners right throughout the project life cycle in Shell IT’s matrix project organization <br />• Manage and control scope to ensure commitments are achieved within agreed time, cost, and quality parameters with constant focus on ensuring business benefits are delivered <br />• Forecast/Plan, acquire, utilize, and manage required project resources and skills appropriately <br />• Effectively manage project finances – forecasting, tracking costs, validating forecasts, managing accruals, providing on-going reconciliation of resources and other related project expenditures <br /> <br />Role Description: <br />• Decide on the project delivery methodology through a careful evaluation <br />• Setup project governance structure and ensure appropriate stakeholder engagement, change and communication plans <br />• Represent the project in various project governance/forums – including formal and informal/ad-hoc reporting <br />• Effectively engage with senior stakeholders in Stage Gate reviews/Quality gate and drive the required results <br />• Defining and tracking project milestones while developing, maintaining, and reporting on an overall integrated delivery plan. Regular project reporting required, via project reporting tool. <br />• Develop project charter, integrated project plan, resource plan, contingency plan, and other project management deliverables <br />• Ability to deliver and handle change and innovation in a fast paced environment <br />• Rigorously manage scope to ensure commitments are achieved within agreed time, cost, and quality parameters <br />• Validates financial forecasts and provides on-going reconciliation of resources and other related project expenditures <br />• Ensure Information Risk Management and compliance related actions are completed as per the Project expectations <br />• Drive growth and success of Shell’s project delivery community – provide coaching/mentoring; conduct project reviews <br /> <br />",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "20-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Scrum Master",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1243151",
    "job_description": "<strong><span><span><font><font>If you’re a proven Scrum Master who enjoys bringing out the best in a teams, making sure Scrum is understood fully and activities are delivered in alignment with standards, this role is for you.</font></font></span></span></strong> <span> </span> <br /> <br /> <br /> <strong><span><span><font><font>What’s the role?</font></font></span></span></strong> <br /> <span><font><font> <br /><span><span>Life doesn’t stand still here – it’s a fast-paced, challenging and incredibly rewarding place to work. You’ll guide the team throughout our interactive software development lifecycle – from planning and execution to control and closure. You’ll facilitate daily stand ups, help the team maintain burn down charts as well as set up retrospectives, sprint reviews and planning sessions. With an eye on delivery, you’ll shield the team from interruptions during the sprint and remove any obstacles in their path.</span></span></font></font></span> <br /> <span><span><font><font>It’s a great role for someone who enjoys building relationships and you’ll effectively manage communications within the team and with any external stakeholders to maximize value created by the scrum team. </font></font></span></span>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "15-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Programme Manager",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1246170",
    "job_description": "<strong>There’s more to this senior role than delivering business benefits on complex projects – you’ll also be sharing your skills to help to building a stronger Programme Management community.</strong> <br /> <span> </span> <br /> <strong>What’s the role?</strong> <br /> <span> </span> <br /> <span>Our Programme Managers have a valuable role to play in making sure IT keeps pace with the world we serve. We trust them to plan, execute monitor and close a suite of interdependent projects, bringing out business benefits that can’t be realised in isolation. As well as ensuring the whole is greater than the sum of its parts, you’ll help to champion the development of our long-term Programme Management capability: you’ll actively seek out best practice, share your skills, coach others and contribute to building the community – it’s a refreshingly collaborative role.</span> <br /> <span> </span> <br /> <span>You’ll relish managing large programmes of high complexity and risk, including financial forecasting and stakeholder communication plans. You’ll need to rigorously manage scope to ensure we hit time, cost and quality targets and deliver the business benefits. Change is a constant, so it’s important you can balance project goals with business context and confidently manage senior stakeholders’ expectations.</span> <br /> <span> </span> <br /> <span>It’s vital that you’re a strong advocate for your team. You’ll help them to flourish by removing the barriers that prevent them delivering their best, developing their skills and recognising their achievements.</span>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "15-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Trading Analyst",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1242930",
    "job_description": "<p><font><font>Shell Trading integrates a worldwide trading network with an unsurpassed global portfolio in crude oil, refined products, natural gas, electrical power, and chemicals and has larger locations in London, Houston, Calgary, Singapore, Dubai, Rotterdam, and Barbados. Shell Trading is one of the world’s largest energy traders and is a key segment of the Royal Dutch Shell portfolio. Shell Energy Europe (SEE) sells and actively trades energy related products and services associated with European natural gas, power, and environmental products. Having been an early mover in integrating marketing. SEE’s Trading hub is based in London with sales offices in 4 other countries. The combined organizations transact with over 600 customers and counterparties. Customers include major resource holders of gas, utilities, power generators, gas distribution companies, and large commercial gas and power users.</font></font><br /> <br /><font><font>The Trading Analyst is expected to:</font></font><br /> </p> <ul> <li><font><font>Enhance and update fundamental models with the supply/demand drivers for South East gas and power markets</font></font></li> <li><font><font>Coordinate closely with other SEE Trading Analysts in Gas, LNG, Power, and CO2 to develop an integrated fundamental forecast</font></font></li> <li><font><font> Identify and communicate irregularities or illogical relationships to the traders, generating questions/ideas to challenge them Identify and distribute news reports that can affect European gas and power markets </font></font></li> <li><font><font>Monitor publicly available information on storage and gas transportation flows</font></font></li> <li><font><font>Develop and monitor daily price curves to support sales channels in various markets</font></font></li> <li><font><font> Monitor Trading Desk’s aggregate FX exposures and prepare daily hedging proposals</font></font></li> <li><font><font>Generate daily oil price curves, using inputs from the oil &amp; products trading desks </font></font></li> <li><font><font>Understand, discuss and balance the financial positions in traders’ books to properly reflect the positions amongst the different channels </font></font></li> <li><font><font>Help the traders monitor their expected P&amp;L each day and produce reconciliations and explanations of drivers</font></font></li> <li><font><font>Share responsibility of correct representation of deals in systems to enable correct exposure management and invoicing</font></font></li> <li><font><font>Help the trading desk track and plan strategies to address any exposures in local sales offices (eg. Spain, Turkey, Italy)</font></font></li> <li><font><font>Write weekly and other commentaries on the activities and performance of the Trading Desk Make new proposals towards end customers sales and liaise with the Sales Offices and traders for their successful roll-out</font></font></li> </ul> <br /> <font><font>Dimensions :</font></font> <br /> <ul> <li><font><font>The Trading Analyst is based in London and reports to one of the senior gas traders. The Trading Analyst is expected to participate in 2 million USD Trading gross margin contributions by providing trade or fundamental recommendations</font></font></li> <li><font><font>The Trading Analyst will develop information on a European basis and co-ordinate with North West Analytics The Trading Analyst sits on the trading desk with the traders and periodically updates them regarding supply and demand changes that could potentially impact the markets</font></font></li> <li><font><font>The Trading Analyst is expected to acquire a strong understanding of the SEE business model and the functional accountability of the teams</font></font></li> <li><font><font>The Trading Analyst is expected to quickly gain a strong understanding of the asset positions of SEEL and other Shell Entities</font></font></li> <li><font><font>The Trading Analyst is expected to contribute to and ensure alignment with SEE goals, processes and strategy</font></font></li> <li><font><font>The Trading Analyst is expected to show year on year growth through proactive involvement in the developing trading strategies of the Trading Desk</font></font></li> </ul>",
    "skill_group": "Trading",
    "location": "United Kingdom",
    "last_updated": "14-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Power Supply Analyst - Germany",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1244632",
    "job_description": "<font><font>As part of executing the Power Growth Strategy since 2016, SEE has been planning to launch a business selling power to German industrial and commercial consumers. After go live in October 2017, we have successfully grown the number of meter points served and plan to grow further in 2018 and beyond. The chosen SEE business model for Power is a centralized trading and operations hub in London, with local representative offices in various countries providing customer liaison and support in cases where language and other factors require it. We therefore now plan to grow the London based operations team to manage these meter points.</font></font> <br /> <br /> <br /> <font><font>This is an exciting opportunity to get early involvement in the operational management of an important growth area for T&amp;S and the Shell Group, developing skills and experiences which will be crucial to Shell achieving its goal of profitably meeting society’s needs and proving a world-class investment case, as we navigate through the energy transition towards a low-carbon energy system. </font></font> <br /> <font><font> <br />Day-to-day activities include setting up and maintaining contracts with power customers, including including the following:<br />• Registration of new meters to Shell’s power balancing accounts<br />• Setup of contracts with new Distribution Network Operators including registration in Shell’s IT systems; monitoring the timeliness and quality of data (e.g. volume reads) coming from the systems, and taking steps to rectify where necessary<br />• Assistance in reconciliation and payment of relevant industry fees and levies, including troubleshooting late/missing/erroneous data from industry participants<br />• Maintaining the configuration of IT<br />systems to support SEE supplying power to end users<br />• Liaison with German Sales Office (Hamburg) to assist in setup of new customers in Shell’s power operations systems.<br />• Maintenance of meter registrations with industry participants, including troubleshooting of issues<br />• Enhancing/streamlining the meter administration processes<br />• Setup/Maintenance of other contracts supporting the delivery of power to end users in Germany<br /><br /><br /> </font></font> <br /> <br /> <br /> <br /> <font><font> </font></font> <br />",
    "skill_group": "Trading",
    "location": "United Kingdom",
    "last_updated": "13-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Account Executive Europe",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1240946",
    "job_description": "<strong>A chance to grow – your career and our market-leading business. Part of our commercial team, you’ll build on your proven ability to turn great customer relationships into even better business deals.<br /><br />Work location: London/Amsterdam</strong> <br /> <br /> <strong>About the team</strong> <br /> <br />You’ll be part of our Criterion business – part of Shell P&amp;T – a major supplier of catalysts to the refining industry and a market leader in multiple product lines. We use our collective knowledge to give Shell’s refineries a technical advantage as well as providing a growing number of external customers with differentiated technical solutions spanning hydro-processing, residue upgrading and hydro-cracking. <br /> <br /> <strong>What’s the role?</strong> <br /> <br />A senior member of the commercial team, you’ll be the primary contact for Criterion’s refining customers, including some of our most valuable clients – both Shell refineries and third-party refiners. <br /> <br />You’ll be targeted to grow our business and increase our margins. A key part of the role is understanding and reporting back on what customers want. You’ll use the market intelligence you gather to craft world-class value propositions, inform our pricing and market strategy, and influence our product development. We want to achieve customer value across the wider catalyst and technology licensing businesses so you’ll need to be able to see the bigger picture and seize opportunities to offer customers services outside your product portfolio; harnessing the support of our regional Hydro processing and Hydrocracking technical service teams. <br /> <br />Whilst it’s not a team-leading role, we’re definitely looking for someone who can bring out the best in less experienced colleagues, coaching them and sharing your experience. <br /> <br />",
    "skill_group": "Commercial and Retail",
    "location": "Netherlands, United Kingdom",
    "last_updated": "12-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Transformation Change Consultant - IT",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1218081",
    "job_description": "<strong>If you are a dedicated Change Management professional preferably with a consulting background, then this role is for you! This is a great development opportunity for someone who’s shown they <a>can deliver</a></strong> <strong> technology-driven change – you’ll bring out the best in others, instill agile mindsets and help us to continually improve the way we bring change to the business. </strong> <br /> <br /> <strong>Where you fit in</strong> <br /> <br />Shell is focused on aligning and simplifying IT systems to increase customer satisfaction and business value. As part of that, we’re building an in-house IT Transformational Change Capability that will partner closely with each area of the business to drive and embed IT change. <br /> <br /> <strong>What’s the role?</strong> <br /> <br />Part of our Group CIO function, this is a delivery-focused role, leading IT-driven business change in a programme/project environment. Join us and you’ll engage with senior business and IT decision-makers to drive the change agenda, both leading and contributing to multiple change projects. <br /> <br />It’s a great developmental opportunity for someone on a career trajectory. On complex projects, you’ll be supported by a Transformational Change Manager. At other times, you’ll drive your own projects and develop your leadership skills, bringing out the best in junior change managers by mentoring, advising and coaching them. There’s great scope to make a positive impact on the way we work, helping to equip the business with the skills to better manage and sustain change. <br /> <br />It’s a refreshingly wide-ranging role; your responsibilities will include: <ul> <li>Deploying measurable change management interventions and wider transformational change initiatives, usually in an Agile <a>context</a>.</li> <li>Staying abreast of external best practice in change management and sharing your insight with colleagues to facilitate knowledge sharing and build our Transformational Change capability.</li> <li>Contributing to developing Agile mindsets and behaviours.</li> </ul> <div> <div></div> </div> <div> <div></div> </div>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "11-Jun-2018",
    "hot_job": "No"
  },
  {
    "title": "Change Manager/Analyst - IT",
    "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1218229",
    "job_description": "<strong>If you are a Change Specialist with a management consulting background then we want to hear you. We are recruiting for Change Consultants, Analysts and Managers of all levels of experience, building a world class internal change practice. This is a great development opportunity for someone who’s shown they can lead technology-driven change – you’ll bring out the best in others, instill agile mindsets and help us to continually improve the way we bring change to the business. </strong> <br /> <br /> <strong>Where you fit in</strong> <br /> <br />Shell is focused on aligning and simplifying IT systems to increase customer satisfaction and business value. As part of that, we’re enhancing our IT Change Capability that will partner closely with each area of the business to drive and embed IT change. <br /> <br /> <strong>What’s the role?</strong> <br /> <br />Part of our Global Functions division, this is a delivery-focused role, leading IT-driven business change in a programme/project environment. Join us and you’ll engage with business and IT decision-makers to drive the change agenda, both leading and contributing to multiple change projects. <br /> <br />It’s a great developmental opportunity for someone on a career trajectory. On complex projects, you’ll be supported by both the Change and broader project team. There’s great scope to make a positive impact on the way we work, helping to equip the business with the skills to better manage and sustain change. <br /> <br />It’s a refreshingly wide-ranging role; your responsibilities will include: <ul> <li>Applying methodologies and tools to identify and manage the people side of change including IT Systems, process and behaviours, usually in an Agile context.</li> <li>Working collaboratively to achieve alignment of change scope, creating the overall change strategy and plans as well as stakeholder identification and management</li> <li>Creating communications strategy, training design and delivery</li> <li>Staying abreast of external best practice in change management and sharing your insight with colleagues to facilitate knowledge sharing and build our Change capability.</li> <li>Contributing to developing Agile mindsets and behaviours.</li> </ul>",
    "skill_group": "Information Technology",
    "location": "United Kingdom",
    "last_updated": "11-Jun-2018",
    "hot_job": "No"
  }
]