[
{"title": "", "jobdetail_link": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&noback=0&partnerid=30030&siteid=5798&jobid=1218229", "job_description": "<strong>If you are a Change Specialist with a management consulting background then we want to hear you. We are recruiting for Change Consultants, Analysts and Managers of all levels of experience, building a world class internal change practice. This is a great development opportunity for someone who’s shown they can lead technology-driven change – you’ll bring out the best in others, instill agile mindsets and help us to continually improve the way we bring change to the business. </strong> <br /> <br /> <strong>Where you fit in</strong> <br /> <br />Shell is focused on aligning and simplifying IT systems to increase customer satisfaction and business value. As part of that, we’re enhancing our IT Change Capability that will partner closely with each area of the business to drive and embed IT change. <br /> <br /> <strong>What’s the role?</strong> <br /> <br />Part of our Global Functions division, this is a delivery-focused role, leading IT-driven business change in a programme/project environment. Join us and you’ll engage with business and IT decision-makers to drive the change agenda, both leading and contributing to multiple change projects. <br /> <br />It’s a great developmental opportunity for someone on a career trajectory. On complex projects, you’ll be supported by both the Change and broader project team. There’s great scope to make a positive impact on the way we work, helping to equip the business with the skills to better manage and sustain change. <br /> <br />It’s a refreshingly wide-ranging role; your responsibilities will include: <ul> <li>Applying methodologies and tools to identify and manage the people side of change including IT Systems, process and behaviours, usually in an Agile context.</li> <li>Working collaboratively to achieve alignment of change scope, creating the overall change strategy and plans as well as stakeholder identification and management</li> <li>Creating communications strategy, training design and delivery</li> <li>Staying abreast of external best practice in change management and sharing your insight with colleagues to facilitate knowledge sharing and build our Change capability.</li> <li>Contributing to developing Agile mindsets and behaviours.</li> </ul>", "skill_group": "Information Technology", "location": "Change Manager/Analyst - IT", "last_updated": "11-Jun-2018", "hot_job": "No"}
]